/*******************************************************************************
 *                                  Log类                                      *
 *-----------------------------------------------------------------------------*
 * 组成：时间 + 操作 + 俱乐部名称 + 资金变化 + 余额 +                                *
 *             2025-05-01 12:30:52  Major  +10000  50000                       *    
 *             2025-05-01 12:20:56  yhc  -20000  30000                         *
 *             2025-05-01 12:30:52  Major  +100  500                           *
 ********************************************************************************/

#pragma once

#include <string>
#include <ctime>
#include <fstream>
#include "../../include/IData.h"

class Log : public IData {         
    public:
    
        // 
        bool load(std::ifstream & in) override;
        
        bool save(std::ofstream & out) override;
};